#+BEGIN_COMMENT
.. title: Auto-Complete: Pre-Process the Data I
.. slug: auto-complete-pre-process-the-data-i
.. date: 2020-12-03 18:24:54 UTC-08:00
.. tags: nlp,n-grams,auto-complete
.. category: NLP
.. link: 
.. description: Pre-processing twitter data for our auto-complete system.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3

#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-8017c69b-fcd8-4392-8c2c-c68164643bf2-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Load the Data
   We're going to use twitter data. There's no listing of the source, so I'm assuming it's the NLTK twitter data. But maybe not.

#+begin_src python :results none
path = os.environ["TWITTER_AUTOCOMPLETE"]
with open(path) as reader:
    data = reader.read()
#+end_src

#+begin_src python :results output :exports both
print("Data type:", type(data))
print(f"Number of letters: {len(data):,}")
print("First 300 letters of the data")
print("-------")
display(data[0:300])
print("-------")

print("Last 300 letters of the data")
print("-------")
display(data[-300:])
print("-------")    
#+end_src

#+RESULTS:
:RESULTS:
: Data type: <class 'str'>
: Number of letters: 3,335,477
: First 300 letters of the data
: -------
: How are you? Btw thanks for the RT. You gonna be in DC anytime soon? Love to see you. Been way, way too long.\nWhen you meet someone special... you'll know. Your heart will beat more rapidly and you'll smile for no reason.\nthey've decided its more fun if I don't.\nSo Tired D; Played Lazer Tag & Ran A 
: -------
: Last 300 letters of the data
: -------
: ust had one a few weeks back....hopefully we will be back soon! wish you the best yo\nColombia is with an 'o'...“: We now ship to 4 countries in South America (fist pump). Please welcome Columbia to the Stunner Family”\n#GutsiestMovesYouCanMake Giving a cat a bath.\nCoffee after 5 was a TERRIBLE idea.\n
: -------
:END:

So the data looks like it's just tweets, without any metadata and is separated using newlines.
** Split Train and Test Sets
#+begin_src python :results none
tokenized_data = get_tokenized_data(data)
random.seed(87)
random.shuffle(tokenized_data)

train_size = int(len(tokenized_data) * 0.8)
train_data = tokenized_data[0:train_size]
test_data = tokenized_data[train_size:]
#+end_src

#+begin_src python :results output :exports both
actual_data, expected_data = len(tokenized_data), 47961
actual_training, expected_training = len(train_data), 38368
actual_testing, expected_testing = len(test_data), 9593

print((f"{actual_data:,} are split into {actual_training:,} training entries"
       f" and {actual_testing:,} test set entries."))

for label, actual, expected in zip(
        "data training testing".split(),
        (actual_data, actual_training, actual_testing),
        (expected_data, expected_training, expected_testing)):
    expect(actual).to(equal(expected)), (label, actual, expected)
#+end_src

#+RESULTS:
: 47,961 are split into 38,368 training entries and 9,593 test set entries.

#+begin_src python :results output :exports both
print("First training sample:")
actual = train_data[0]
print(actual)
expected = ["i", "personally", "would", "like", "as", "our", "official", "glove",
            "of", "the", "team", "local", "company", "and", "quality",
            "production"]
expect(actual).to(contain_exactly(*expected))
#+end_src

#+RESULTS:
: First training sample:
: ['i', 'personally', 'would', 'like', 'as', 'our', 'official', 'glove', 'of', 'the', 'team', 'local', 'company', 'and', 'quality', 'production']

#+begin_src python :results output :exports both
print("First test sample")
actual = test_data[0]
print(actual)
expected = ["that", "picture", "i", "just", "seen", "whoa", "dere", "!", "!",
            ">", ">", ">", ">", ">", ">", ">"]
expect(actual).to(contain_exactly(*expected))
#+end_src

#+RESULTS:
: First test sample
: ['that', 'picture', 'i', 'just', 'seen', 'whoa', 'dere', '!', '!', '>', '>', '>', '>', '>', '>', '>']

